import './ViewerContent.scss';

const ViewerContent = ({ fontMode, themeMode }) => {
  return (
    <div className={`viewer-content ${fontMode} ${themeMode}`}>
      <p>
        대법관은 대법원장의 제청으로 국회의 동의를 얻어 대통령이 임명한다.
        대통령은 헌법과 법률이 정하는 바에 의하여 국군을 통수한다. 사법권은
        법관으로 구성된 법원에 속한다. 대통령은 헌법과 법률이 정하는 바에 의하여
        공무원을 임면한다. 국채를 모집하거나 예산외에 국가의 부담이 될 계약을
        체결하려 할 때에는 정부는 미리 국회의 의결을 얻어야 한다. 국가는
        사회보장·사회복지의 증진에 노력할 의무를 진다. 대통령은
        국무총리·국무위원·행정각부의 장 기타 법률이 정하는 공사의 직을 겸할 수
        없다. 행정권은 대통령을 수반으로 하는 정부에 속한다. 대통령은 법률이
        정하는 바에 의하여 훈장 기타의 영전을 수여한다. 군인 또는 군무원이 아닌
        국민은 대한민국의 영역안에서는 중대한 군사상
        기밀·초병·초소·유독음식물공급·포로·군용물에 관한 죄중 법률이 정한 경우와
        비상계엄이 선포된 경우를 제외하고는 군사법원의 재판을 받지 아니한다.\n\n
        대통령은 제1항과 제2항의 처분 또는 명령을 한 때에는 지체없이 국회에
        보고하여 그 승인을 얻어야 한다. 정부는 회계연도마다 예산안을 편성하여
        회계연도 개시 90일전까지 국회에 제출하고, 국회는 회계연도 개시
        30일전까지 이를 의결하여야 한다. 이 헌법시행 당시에 이 헌법에 의하여
        새로 설치될 기관의 권한에 속하는 직무를 행하고 있는 기관은 이 헌법에
        의하여 새로운 기관이 설치될 때까지 존속하며 그 직무를 행한다. 대법원은
        법률에 저촉되지 아니하는 범위안에서 소송에 관한 절차, 법원의 내부규율과
        사무처리에 관한 규칙을 제정할 수 있다. 대통령은 국가의 독립·영토의
        보전·국가의 계속성과 헌법을 수호할 책무를 진다. 형사피고인은 유죄의
        판결이 확정될 때까지는 무죄로 추정된다. 대통령은 제3항과 제4항의 사유를
        지체없이 공포하여야 한다. 대통령은 국가의 안위에 관계되는 중대한
        교전상태에 있어서 국가를 보위하기 위하여 긴급한 조치가 필요하고 국회의
        집회가 불가능한 때에 한하여 법률의 효력을 가지는 명령을 발할 수
        있다.\n\n 대통령은 법률에서 구체적으로 범위를 정하여 위임받은 사항과
        법률을 집행하기 위하여 필요한 사항에 관하여 대통령령을 발할 수 있다.
        국정의 중요한 사항에 관한 대통령의 자문에 응하기 위하여 국가원로로
        구성되는 국가원로자문회의를 둘 수 있다. 국회의 회의는 공개한다. 다만,
        출석의원 과반수의 찬성이 있거나 의장이 국가의 안전보장을 위하여
        필요하다고 인정할 때에는 공개하지 아니할 수 있다. 헌법개정안은 국회가
        의결한 후 30일 이내에 국민투표에 붙여 국회의원선거권자 과반수의 투표와
        투표자 과반수의 찬성을 얻어야 한다. 국회의원은 국가이익을 우선하여
        양심에 따라 직무를 행한다. 군사재판을 관할하기 위하여 특별법원으로서
        군사법원을 둘 수 있다. 원장은 국회의 동의를 얻어 대통령이 임명하고, 그
        임기는 4년으로 하며, 1차에 한하여 중임할 수 있다. 국민의 자유와 권리는
        헌법에 열거되지 아니한 이유로 경시되지 아니한다. 대통령은 취임에
        즈음하여 다음의 선서를 한다. 언론·출판은 타인의 명예나 권리 또는
        공중도덕이나 사회윤리를 침해하여서는 아니된다. 언론·출판이 타인의 명예나
        권리를 침해한 때에는 피해자는 이에 대한 피해의 배상을 청구할 수 있다.
        지방의회의 조직·권한·의원선거와 지방자치단체의 장의 선임방법 기타
        지방자치단체의 조직과 운영에 관한 사항은 법률로 정한다. 근로자는
        근로조건의 향상을 위하여 자주적인 단결권·단체교섭권 및 단체행동권을
        가진다. 정부는 예산에 변경을 가할 필요가 있을 때에는 추가경정예산안을
        편성하여 국회에 제출할 수 있다.\n\n 헌법재판소는 법관의 자격을 가진
        9인의 재판관으로 구성하며, 재판관은 대통령이 임명한다. 법률안에 이의가
        있을 때에는 대통령은 제1항의 기간내에 이의서를 붙여 국회로 환부하고, 그
        재의를 요구할 수 있다. 국회의 폐회중에도 또한 같다. 국민경제자문회의의
        조직·직무범위 기타 필요한 사항은 법률로 정한다. 군인은 현역을 면한 후가
        아니면 국무위원으로 임명될 수 없다. 제안된 헌법개정안은 대통령이 20일
        이상의 기간 이를 공고하여야 한다. 국가는 주택개발정책등을 통하여 모든
        국민이 쾌적한 주거생활을 할 수 있도록 노력하여야 한다. 비상계엄하의
        군사재판은 군인·군무원의 범죄나 군사에 관한 간첩죄의 경우와
        초병·초소·유독음식물공급·포로에 관한 죄중 법률이 정한 경우에 한하여
        단심으로 할 수 있다. 다만, 사형을 선고한 경우에는 그러하지 아니하다.
        계엄을 선포한 때에는 대통령은 지체없이 국회에 통고하여야 한다. 대통령은
        제4항과 제5항의 규정에 의하여 확정된 법률을 지체없이 공포하여야 한다.
        제5항에 의하여 법률이 확정된 후 또는 제4항에 의한 확정법률이 정부에
        이송된 후 5일 이내에 대통령이 공포하지 아니할 때에는 국회의장이 이를
        공포한다. 모든 국민은 그 보호하는 자녀에게 적어도 초등교육과 법률이
        정하는 교육을 받게 할 의무를 진다. 위원은 탄핵 또는 금고 이상의 형의
        선고에 의하지 아니하고는 파면되지 아니한다. 비상계엄이 선포된 때에는
        법률이 정하는 바에 의하여 영장제도, 언론·출판·집회·결사의 자유, 정부나
        법원의 권한에 관하여 특별한 조치를 할 수 있다. 국가는 과학기술의 혁신과
        정보 및 인력의 개발을 통하여 국민경제의 발전에 노력하여야 한다. 헌법에
        의하여 체결·공포된 조약과 일반적으로 승인된 국제법규는 국내법과 같은
        효력을 가진다. 선거에 관한 경비는 법률이 정하는 경우를 제외하고는 정당
        또는 후보자에게 부담시킬 수 없다. 국회가 재적의원 과반수의 찬성으로
        계엄의 해제를 요구한 때에는 대통령은 이를 해제하여야 한다. 언론·출판에
        대한 허가나 검열과 집회·결사에 대한 허가는 인정되지 아니한다. 국가는
        모성의 보호를 위하여 노력하여야 한다. 대통령은 필요하다고 인정할 때에는
        외교·국방·통일 기타 국가안위에 관한 중요정책을 국민투표에 붙일 수 있다.
        모든 국민은 법률이 정하는 바에 의하여 선거권을 가진다. 제2항의 재판관중
        3인은 국회에서 선출하는 자를, 3인은 대법원장이 지명하는 자를 임명한다.
        각급 선거관리위원회의 조직·직무범위 기타 필요한 사항은 법률로 정한다.
        국회의원의 수는 법률로 정하되, 200인 이상으로 한다. 선거에 있어서
        최고득표자가 2인 이상인 때에는 국회의 재적의원 과반수가 출석한
        공개회의에서 다수표를 얻은 자를 당선자로 한다. 위원은 정당에 가입하거나
        정치에 관여할 수 없다. 국무총리 또는 행정각부의 장은 소관사무에 관하여
        법률이나 대통령령의 위임 또는 직권으로 총리령 또는 부령을 발할 수
        있다.\n\n 헌법재판소에서 법률의 위헌결정, 탄핵의 결정, 정당해산의 결정
        또는 헌법소원에 관한 인용결정을 할 때에는 재판관 6인 이상의 찬성이
        있어야 한다. 모든 국민은 근로의 의무를 진다. 국가는 근로의 의무의 내용과
        조건을 민주주의원칙에 따라 법률로 정한다. 대통령으로 선거될 수 있는 자는
        국회의원의 피선거권이 있고 선거일 현재 40세에 달하여야 한다. 대한민국은
        국제평화의 유지에 노력하고 침략적 전쟁을 부인한다. 국가는 청원에 대하여
        심사할 의무를 진다. 정당의 설립은 자유이며, 복수정당제는 보장된다. 이
        헌법시행 당시의 법령과 조약은 이 헌법에 위배되지 아니하는 한 그 효력을
        지속한다. 법률이 정하는 주요방위산업체에 종사하는 근로자의 단체행동권은
        법률이 정하는 바에 의하여 이를 제한하거나 인정하지 아니할 수 있다.
        법률이 헌법에 위반되는 여부가 재판의 전제가 된 경우에는 법원은
        헌법재판소에 제청하여 그 심판에 의하여 재판한다.
      </p>
    </div>
  );
};

export default ViewerContent;
